<?php

// for 문 : 특정 처리를 반복적으로 구현하고자 할때 사용

// 0~ 5까지 숫자를 출력
// echo "0"."\n";
// echo "1"."\n";
// echo "2"."\n";
// echo "3"."\n";
// echo "4"."\n";
// echo "5"."\n";

// for($i =0; $i <6; $i++) { // for 사용할 때 조건을 잘못주면 무한반복으로 cpu 메모리가 과다 되어서 작업관리자로 vscode를 강제 종료해야한다.
//     // 우리가 반복하고 싶은 처리 처리하는 값이 true가 되면 계속실행 false가 되면 중지
//     echo "숫자: ".$i."\n";
// }

// break : 처리중에 break를 만나면 루프 종료
// for($i =1; $i <6; $i++) {  // 숫자 :1 ,2
//     if($i === 3) {
//         break;
//     }                                    
//     echo "숫자: ".$i."\n";    
// }

// for($i =1; $i <6; $i++) {  // 숫자: 1 ,2 ,3 조건값이랑 다르면 위로 다시 올라가서 값을 출력하고 값이 같으면 종료
//     echo "숫자: ".$i."\n";    
//     if($i === 3) {
//         break;
//     }                                    
// }
//  ---------------------
// continue문 : 처리중에 continue를 만나면 이후의 처리를 건너뛰고 다음 루프 진행
// for($i =1; $i <6; $i++) {
//     if(($i % 2 ) === 0) {
//         continue;
//     }
//     // 우리가 반복하고 싶은 처리
//     echo "숫자: ".$i."\n";
// }

// 구구단 2단 출력
// 2x1 =2
// 2x2 =4
// 2x3 =6
// ....
// 2x9 =18

// for($i =1; $i <=9; $i++) {
//     $dan =2;
    // echo "2 X ".$i."=".(2*$i)."\n";    
// }

// 
// $dan =3;
// for($i =1; $i <= 9; $i++) {   
//     echo $dan." X ".$i." = ".($dan*$i)."\n";    
// }

// ----------------
// 다중 루프문
// ----------------
// for($i= 1; $i <3; $i++) {
//     echo "바깥 LOOP문: ".$i."\n";

//     for($z =1; $z <3; $z++) {
//         echo "안쪽 LOOP문: z값=".$z.", i값 =".$i."\n";
//     }
// }

// 2단 ~ 9단을 출력
// 예시)
// ** 2단 **
// 2 X 1 = 2
// 2 X 2 = 4
// ...
// ** 3단 **
// 3 X 1 = 3
// 3 X 2 = 6
// ...
// 9 X 8 = 72
// 9 X 9 = 81
// for($dan =2; $dan <= 9; $dan++) {
//     echo "**".$dan."단 "."**"."\n";

//     for($multi =1; $multi <=9; $multi++) {
//         echo $dan." X".$multi."=".($dan *$multi)."\n";
//     }
// }
// 아래처럼 별을 찍어주세요.
// 예시)
// *****
// *****
// *****
// *****
// *****

// for($i= 1; $i <=5; $i++) {
//     echo "*****\n";
// }


// 아래처럼 별을 찍어주세요.
// 예시)
// *
// **
// ***
// ****
// *****
// for ($i=1; $i <=5; $i++) {

//     for($z=1; $z <=$i; $z++){
//         echo "*";
//     }     
//     echo "\n";
// }

// // 아래처럼 별을 찍어주세요.
// // 예시)
// //     *
// //    **
// //   ***
// //  ****
// // *****
// $num= 5;
// for ($i = 1; $i <= $num; $i++) {
//     for($z = $num- $i; $z >0; $z-- ){
//         echo " ";
//     }
//     for($k = 1; $k <= $i; $k++) {
//         echo "*";
//     }
//     echo "\n";
// }

// 구구단 6단 -식 5분
// for($i=1; $i <=9; $i++) {
//     $dan=6;
//     echo $dan."X".$i." = ".(6*$i)."\n";
// }
           